# PlacementLevelId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NumberSystem..::..PlacementLevelId Property
NumberSystem Class See Also
---
The id of the base level of stairs on which the NumberSystem is placed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public LinkElementId PlacementLevelId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PlacementLevelId As LinkElementId
	Get
```

Visual C++
---
```text
public:
property LinkElementId^ PlacementLevelId {
	LinkElementId^ get ();
}
```

# Remarks
In multistory stairs, a stairs element could be a stair group or individual stair, this level could be the base level of group member or stairs element.
# See Also
NumberSystem Class
Autodesk.Revit.DB Namespace